In [1]:
import numpy as np
import pandas as pd

In [30]:
data  = {
    'name':["jhon","anna","peter","blood"],
    'age':[28,34,29,35],
    'city':['ny','paris','berlin','korea'],
    'salary':[65000,70000,6200,10000]
}
df= pd.DataFrame(data)

In [8]:
df

    name  age    city  salary
0   jhon   28      ny   65000
1   anna   34   paris   70000
2  peter   29  berlin    6200

In [13]:
df[['name','city']]

    name    city
0   jhon      ny
1   anna   paris
2  peter  berlin

In [14]:
df['designation']=['doctor','engineer','doc']
df

    name  age    city  salary designation
0   jhon   28      ny   65000      doctor
1   anna   34   paris   70000    engineer
2  peter   29  berlin    6200         doc

In [15]:
# removal of col

df.drop('designation',axis=1)

    name  age    city  salary
0   jhon   28      ny   65000
1   anna   34   paris   70000
2  peter   29  berlin    6200

In [16]:
df

    name  age    city  salary designation
0   jhon   28      ny   65000      doctor
1   anna   34   paris   70000    engineer
2  peter   29  berlin    6200         doc

In [20]:
df

    name  age    city  salary
0   jhon   28      ny   65000
1   anna   34   paris   70000
2  peter   29  berlin    6200

In [21]:
df['score']=[10,20,30]
df

    name  age    city  salary  score
0   jhon   28      ny   65000     10
1   anna   34   paris   70000     20
2  peter   29  berlin    6200     30

In [22]:
df.drop('score',axis=1,inplace=True)
df

    name  age    city  salary
0   jhon   28      ny   65000
1   anna   34   paris   70000
2  peter   29  berlin    6200

In [25]:
# selection of row

df.loc[[0,1]]

   name  age   city  salary
0  jhon   28     ny   65000
1  anna   34  paris   70000

In [26]:
df.loc[[0,1]][['city','salary']]

    city  salary
0     ny   65000
1  paris   70000

In [29]:
df.loc[[1,2]][['name','age']]

    name  age
1   anna   34
2  peter   29

In [31]:
# conditional selection

df[df['age']>30]

    name  age   city  salary
1   anna   34  paris   70000
3  blood   35  korea   10000

In [34]:
df[(df['age']>30)  & (df['city']=='paris')]

   name  age   city  salary
1  anna   34  paris   70000